In [ ]:
!pip --version

pip 24.1.2 from /usr/local/lib/python3.12/dist-packages/pip (python 3.12)

In [ ]:
import numpy as np
import pandas as pd

l1 = [-17, "99", 2.9, 0,55]
# a1 = np.array([-17, 99, 2, 0,55])
a1 = np.array(l1)
a2 = np.ones(5, dtype=np.int64)
a3 = np.zeros(4, dtype=np.int64)
print(l1, type(l1))
print(a1, type(a1), a1.shape)
print(a2, type(a2), a2.shape)
print(a3, type(a3), a3.shape)

[-17, '99', 2.9, 0, 55] <class 'list'>
['-17' '99' '2.9' '0' '55'] <class 'numpy.ndarray'> (5,)
[1 1 1 1 1] <class 'numpy.ndarray'> (5,)
[0 0 0 0] <class 'numpy.ndarray'> (4,)

In [ ]:
df1 = pd.DataFrame(
    [
        [10, 7, 91],
        [22, -17, 4]
    ], index=[1, 2], columns=['python', 'java', 'php']
)
print(df1)
df1 = df1.rename(columns={'python': 'pyt', 'java': 'jav', 'php': 'php'})
print(df1)
print(df1.iloc[1, 1])
# df1.iloc[1, 1] = 17
# df1.iloc[0, 2] = 19
df1.loc[2, 'jav'] = 17
df1.loc[1, 'php'] = 19
print(df1)

   python  java  php
1      10     7   91
2      22   -17    4
   pyt  jav  php
1   10    7   91
2   22  -17    4
-17
   pyt  jav  php
1   10    7   19
2   22   17    4

In [ ]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
# print(titanic.info())
# print(titanic.tail(3))
print(titanic.query('age >= 70'))

     survived  pclass   sex   age  sibsp  parch     fare embarked   class  \
96          0       1  male  71.0      0      0  34.6542        C   First
116         0       3  male  70.5      0      0   7.7500        Q   Third
493         0       1  male  71.0      0      0  49.5042        C   First
630         1       1  male  80.0      0      0  30.0000        S   First
672         0       2  male  70.0      0      0  10.5000        S  Second
745         0       1  male  70.0      1      1  71.0000        S   First
851         0       3  male  74.0      0      0   7.7750        S   Third

     who  adult_male deck  embark_town alive  alone
96   man        True    A    Cherbourg    no   True
116  man        True  NaN   Queenstown    no   True
493  man        True  NaN    Cherbourg    no   True
630  man        True    A  Southampton   yes   True
672  man        True  NaN  Southampton    no   True
745  man        True    B  Southampton    no  False
851  man        True  NaN  Southampton    no   True